In [1]:
# Import necessary libraries
import pandas as pd
import matplotlib.pyplot as plt
import seaborn as sns

   price  mileage  year trim engine transmission
0  14995    67697  2006   ex  4 Cyl       Manual
1  11988    73738  2006   ex  4 Cyl       Manual
2  11999    80313  2006   lx  4 Cyl    Automatic
3  12995    86096  2006   lx  4 Cyl    Automatic
4  11333    79607  2006   lx  4 Cyl    Automatic